Autodesk.Revit.DB.LevelAssociationData.SetLevelOffset(System.Double)
Sets the offset from the Associated Level.
offset:
The offset from the Level.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2023

Autodesk.Revit.DB.LevelAssociationData.GetLevelAssociationData(Autodesk.Revit.DB.Element)
Returns LevelAssociationData associated with this element, if it exists.
Remarks:
If the input element doesn't have LevelAssociationData than it retuns null.
element:
The element from which we try to obtain LevelAssociationData.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.LevelAssociationData.GetLevelOffset
Returns the offset from the Associated Level.
Since:
2023

Autodesk.Revit.DB.LevelAssociationData.SetAssociatedLevel(Autodesk.Revit.DB.ElementId)
Sets the Associated Level.
levelId:
The id of the Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2023

Autodesk.Revit.DB.LevelAssociationData.GetAssociatedLevel
Returns the Associated Level id.
Since:
2023

Autodesk.Revit.DB.LevelAssociationData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.LevelAssociationData
This class holds information related to Level.
Since:
2023